
&НаКлиенте
Процедура СоставТипОбъектаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораТипаОбъекта", ЭтотОбъект); 
    ОткрытьФорму("Справочник.otus_Соединения.Форма.ВыборТипаОбъекта",, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораТипаОбъекта(Результат, ДопПарам) Экспорт 
	
	Если Результат <> Неопределено Тогда
		Элементы.Состав.ТекущиеДанные.ТипОбъекта = Результат; 
	КонецЕсли;
		
КонецПроцедуры
