
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Справочник Из Метаданные.Справочники Цикл
		
		ТипыОбъектов.Добавить(Справочник.ПолноеИмя(), СтрШаблон("%1 (Справочник)", Справочник.Синоним));
		
	КонецЦикла;
	
	Для Каждого Документ Из Метаданные.Документы Цикл
		
		ТипыОбъектов.Добавить(Документ.ПолноеИмя(), СтрШаблон("%1 (Документ)", Документ.Синоним));
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	Закрыть(Элементы.ТипыОбъектов.ТекущиеДанные.Значение);
КонецПроцедуры

&НаКлиенте
Процедура ТипыОбъектовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Закрыть(Элементы.ТипыОбъектов.ТекущиеДанные.Значение);
КонецПроцедуры
