#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
   ЮТТесты.ДобавитьТестовыйНабор("ПроверкаРегистрацииОбъектовКОбмену").ВТранзакции()
   	.ДобавитьТест("ПроверкаЗаписиСоединения", "Проверка записи соединения", "Позитив")
	.ДобавитьТест("ПроверкаРегистрацииКОтправке_Позитив", "Проверка регистрации к отправке позитив", "Позитив")
	.ДобавитьТест("ПроверкаРегистрацииКОтправке_Негатив", "Проверка регистрации к отправке негатив", "Негатив")
	;

КонецПроцедуры

Процедура ПроверкаЗаписиСоединения() Экспорт
	
	// 1. Выполнение функции
	Соединение = ОМ_СозданиеОбъектов.СоздатьСоединение(Перечисления.otus_НаправленияОбмена.Отправка); 
	
	// 2. Проверка результата.
	ЮТест.ОжидаетЧто(Соединение)
		.ИмеетТип("СправочникСсылка.otus_Соединения")
		.Свойство("Наименование").Равно("Тестовое соединение")
		;
		
КонецПроцедуры 

Процедура ПроверкаРегистрацииКОтправке_Позитив() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	Соединение = ОМ_СозданиеОбъектов.СоздатьСоединение(Перечисления.otus_НаправленияОбмена.Отправка);
	
	ОсновныеДанные = Новый Структура();
	ОсновныеДанные.Вставить("Организация", Ютест.Данные().СоздатьЭлемент("Справочник._ДемоОрганизации")); 
	ОсновныеДанные.Вставить("Партнер", Ютест.Данные().СоздатьЭлемент("Справочник._ДемоПартнеры")); 
	
	// 2. Выполнение функции.
	ДокументЗаказ = ОМ_СозданиеОбъектов.СоздатьДокументЗаказКлиента(ОсновныеДанные, Перечисления._ДемоСтатусыЗаказовПокупателей.Создан);
	
	// 3. Проверка результата 
	// 3.1. Проверяем, что документ записался (хотя эта проверка относится не только к интеграции, со временем лучше вынести отдельно).
	ЮТест.ОжидаетЧто(ДокументЗаказ)
		.ИмеетТип("ДокументСсылка._ДемоЗаказПокупателя")
		.Свойство("Номер").Заполнено()
		;
		
	// 3.2. Проверяем наличие движений по регистру сведений "Сообщения к отправке (otus)"
    ИмяРегистра = "РегистрСведений.otus_СообщенияКОтправке";

	ОтборЗаказ = ЮТест.Предикат()
	    .Реквизит("Объект").Равно(ДокументЗаказ)
		.Реквизит("Соединение").Равно(Соединение)
		.Реквизит("ИмяОчереди").Равно("testTopic")
	    .Получить();
			
	ЮТест.ОжидаетЧто(
   		ЮТЗапросы.ТаблицаСодержитЗаписи(ИмяРегистра, ОтборЗаказ))
    	.ЭтоИстина();
		
КонецПроцедуры

Процедура ПроверкаРегистрацииКОтправке_Негатив() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	Соединение = ОМ_СозданиеОбъектов.СоздатьСоединение(Перечисления.otus_НаправленияОбмена.Отправка);
	
	ОсновныеДанные = Новый Структура();
	ОсновныеДанные.Вставить("Организация", Ютест.Данные().СоздатьЭлемент("Справочник._ДемоОрганизации")); 
	ОсновныеДанные.Вставить("Партнер", Ютест.Данные().СоздатьЭлемент("Справочник._ДемоПартнеры")); 
	
	// 2. Выполнение функции.
	ДокументЗаказ = ОМ_СозданиеОбъектов.СоздатьДокументЗаказКлиента(ОсновныеДанные, Перечисления._ДемоСтатусыЗаказовПокупателей.Отменен);
	
	// 3. Проверка результата 
	ЗаказОбъект = ДокументЗаказ.ПолучитьОбъект();
	
	// 3.1. Проверяем, что документ проводится.
	ЮТест.ОжидаетЧто(ЗаказОбъект)
		.Метод("Записать").Параметр(РежимЗаписиДокумента.Проведение)
		.НеВыбрасываетИсключение()
		;
		
	// 3.2. Проверяем наличие движений по регистру сведений "Сообщения к отправке (otus)"
    ИмяРегистра = "РегистрСведений.otus_СообщенияКОтправке";

	ОтборЗаказ = ЮТест.Предикат()
	    .Реквизит("Объект").Равно(ДокументЗаказ)
		.Реквизит("Соединение").Равно(Соединение)
		.Реквизит("ИмяОчереди").Равно("testTopic")
	    .Получить();
			
	ЮТест.ОжидаетЧто(
   		ЮТЗапросы.ТаблицаСодержитЗаписи(ИмяРегистра, ОтборЗаказ))
    	.ЭтоЛожь();
		
		
КонецПроцедуры

#КонецОбласти


