#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
   ЮТТесты.ДобавитьТестовыйНабор("ПроверкаОбменаСKafka").ВТранзакции()
   	.ДобавитьТест("ПроверкаПодключенияКомпоненты", "Проверка подключения компоненты", "Позитив")
	.ДобавитьТест("ПроверкаУстановкиСоединения", "Проверка установки соединения", "Позитив")
	.ДобавитьТест("ПроверкаОтправкиСообщения", "Проверка отправки сообщения", "Позитив")
	.ДобавитьТест("ПроверкаПолученияСообщения", "Проверка получения сообщения", "Позитив")
	;

КонецПроцедуры

Процедура ПроверкаПодключенияКомпоненты() Экспорт
	
	// 1. Выполнение функции.
	РезультатПодключения = otus_kafka.ВыполнитьПодключениеВнешнейКомпоненты();
	
	// 2. Проверка результата.
	ЮТест.ОжидаетЧто(РезультатПодключения)
		.ИмеетТип("Структура")
		.Свойство("Успешно").Равно(Истина)
		;
		
КонецПроцедуры 

Процедура ПроверкаУстановкиСоединения() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
    Соединение = ОМ_СозданиеОбъектов.СоздатьСоединение(Перечисления.otus_НаправленияОбмена.Отправка, "TestGroupID");
	ДанныеСоединения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Соединение, "Адрес,Состав");
	СоставСоединение = ДанныеСоединения.Состав.Выгрузить();
	
	// 2. Выполнение функции.
	ДанныеОтправителя = otus_kafka.СоздатьОтправителя();			
	ОтправительИнициализирован = ДанныеОтправителя.Producer.Initialize(ДанныеСоединения.Адрес, СоставСоединение[0].ИмяОчереди, -1);
	
	ДанныеПолучателя = otus_kafka.СоздатьПолучателя();			
	ПолучательИнициализирован = ДанныеПолучателя.Consumer.Инициализация(ДанныеСоединения.Адрес, СоставСоединение[0].Группа);
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(ДанныеОтправителя)
		.ИмеетТип("Структура")
		.Свойство("Успешно").Равно(Истина)
		;		
	ЮТест.ОжидаетЧто(ОтправительИнициализирован)
		.ИмеетТип("Булево").Равно(Истина)
		;
		
	ЮТест.ОжидаетЧто(ДанныеПолучателя)
		.ИмеетТип("Структура")
		.Свойство("Успешно").Равно(Истина)
		;
		
	ЮТест.ОжидаетЧто(ПолучательИнициализирован)
		.ИмеетТип("Булево").Равно(Истина)
		
КонецПроцедуры 


Процедура ПроверкаОтправкиСообщения() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
    Соединение = ОМ_СозданиеОбъектов.СоздатьСоединение(Перечисления.otus_НаправленияОбмена.Отправка);
	ДанныеСоединения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Соединение, "Адрес,Состав");
	СоставСоединение = ДанныеСоединения.Состав.Выгрузить();
	УИДЗаписи = Новый УникальныйИдентификатор();
	
	ДанныеОтправителя = otus_kafka.СоздатьОтправителя(); 
	ОтправительИнициализирован = ДанныеОтправителя.Producer.Initialize(ДанныеСоединения.Адрес, СоставСоединение[0].ИмяОчереди, -1);
	
	// 2. Выполнение функции.	
	мДанныеНаЗапись = Новый Массив();
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Новый Структура());
	ТекстСообщения = ЗаписьJSON.Закрыть();
	
	мЗаголовки = Новый Массив();
	мДанныеНаЗапись.Добавить(Новый Структура("Key, Value, Headers", XMLСтрока(УИДЗаписи), ТекстСообщения, мЗаголовки));
		
	ОтправкаУспешна = otus_Интеграция.ОтправитьМассивДанныхВKafka(ДанныеОтправителя.Producer, мДанныеНаЗапись);
		
	
	// 3. Проверка результата 
	ЮТест.ОжидаетЧто(ОтправкаУспешна)
		.ИмеетТип("Булево").Равно(Истина)
		;
				
КонецПроцедуры

Процедура ПроверкаПолученияСообщения() Экспорт

	// 1. Подготовка параметров и генерация данных для выполнения функции.
    Соединение = ОМ_СозданиеОбъектов.СоздатьСоединение(Перечисления.otus_НаправленияОбмена.Отправка, "TestGroupID");
	ДанныеСоединения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Соединение, "Адрес,Состав");
	СоставСоединение = ДанныеСоединения.Состав.Выгрузить();
	УИДЗаписи = Новый УникальныйИдентификатор();
	
	ДанныеОтправителя = otus_kafka.СоздатьОтправителя(); 
	ДанныеОтправителя.Producer.Initialize(ДанныеСоединения.Адрес, СоставСоединение[0].ИмяОчереди, -1);
	
	ДанныеПолучателя = otus_kafka.СоздатьПолучателя();
	otus_kafka.Получатель_УстановитьПараметрыПоУмолчанию(ДанныеПолучателя.Consumer);
	ДанныеПолучателя.Consumer.Инициализация(ДанныеСоединения.Адрес, СоставСоединение[0].Группа);
	
	// 2. Выполнение функции.	
	мДанныеНаЗапись = Новый Массив();
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Новый Структура());
	ТекстСообщения = ЗаписьJSON.Закрыть();
	
	мЗаголовки = Новый Массив();
	мДанныеНаЗапись.Добавить(Новый Структура("Key, Value, Headers", XMLСтрока(УИДЗаписи), ТекстСообщения, мЗаголовки));
		
	otus_Интеграция.ОтправитьМассивДанныхВKafka(ДанныеОтправителя.Producer, мДанныеНаЗапись);
	
	мТопики = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СоставСоединение[0].ИмяОчереди);
	сткРезультат = otus_kafka.Получатель_Подписаться(мТопики, ДанныеПолучателя.Consumer);
		
	РезультатЧтения = otus_kafka.ПрочитатьСообщение(ДанныеПолучателя.Consumer);
	
	// 3. Проверка результата 
	ЮТест.ОжидаетЧто(РезультатЧтения)
		.ИмеетТип("Структура")
		.Свойство("Успешно").Равно(Истина)
		; 
		
	ЮТест.ОжидаетЧто(РезультатЧтения.Данные)
		.ИмеетТип("ТаблицаЗначений")
		.Содержит(ЮТест.Предикат()
    	.Реквизит("key").Равно(XMLСтрока(УИДЗаписи)))
	;
		
КонецПроцедуры

#КонецОбласти
