
Функция ВыполнитьПодключениеВнешнейКомпоненты() Экспорт 
	Возврат ВыполнитьПодключениеВнешнейКомпонентыМакет();
КонецФункции

Функция ВыполнитьПодключениеВнешнейКомпонентыМакет()	
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("Успешно", Ложь);
	сткРезультат.Вставить("стрОписаниеОшибки", "");     
	
	СистемнаяИнформация = Новый СистемнаяИнформация();
	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда	
		МакетКомпоненты = ПолучитьОбщийМакет("otus_librdkafka_win32");
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		МакетКомпоненты = ПолучитьОбщийМакет("otus_librdkafka_win64");
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 Тогда
		МакетКомпоненты = ПолучитьОбщийМакет("otus_librdkafka_linux32");	
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64 Тогда
		МакетКомпоненты = ПолучитьОбщийМакет("otus_librdkafka_linux64");		
	Иначе
		сткРезультат.стрОписаниеОшибки = "Не поддерживаемая архитектура платформы";
		Возврат сткРезультат;
	КонецЕсли;
	
	Попытка
		_РезультатПодключенияВнешнейКомпоненты = ПодключитьВнешнююКомпоненту(ПоместитьВоВременноеХранилище(МакетКомпоненты), "librdkafka", ТипВнешнейКомпоненты.Native);
		Если НЕ _РезультатПодключенияВнешнейКомпоненты Тогда
			сткРезультат.стрОписаниеОшибки = "Ошибка подключения внешней компоненты";
			Возврат сткРезультат;
		КонецЕсли;
	Исключение
		сткРезультат.стрОписаниеОшибки = ОписаниеОшибки();
		Возврат сткРезультат;
	КонецПопытки;
	
	сткРезультат.Успешно = Истина;
	
	Возврат сткРезультат;
КонецФункции   

#Область Отправка

Функция СоздатьОтправителя() Экспорт
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("Успешно", Ложь);
	сткРезультат.Вставить("стрОписаниеОшибки", "");
	сткРезультат.Вставить("Producer", Неопределено);
	
	Попытка
		 сткРезультат.Producer = Новый("AddIn.librdkafka.KafkaProducer");
		 сткРезультат.Успешно = Истина;
		 Возврат сткРезультат;
	Исключение
	КонецПопытки;
	
	сткРезультатПодключения = ВыполнитьПодключениеВнешнейКомпоненты();
	Если Не сткРезультатПодключения.Успешно Тогда
		сткРезультат.стрОписаниеОшибки = сткРезультатПодключения.стрОписаниеОшибки;
		Возврат сткРезультат;	 
	КонецЕсли;
	 	 
	Попытка
		 сткРезультат.Producer = Новый("AddIn.librdkafka.KafkaProducer");
	Исключение
		сткРезультат.стрОписаниеОшибки = ОписаниеОшибки();
		Возврат сткРезультат;
	КонецПопытки;
	
	сткРезультат.Успешно = Истина;
	Возврат сткРезультат;
КонецФункции   

Функция Отправитель_ЗагрузитьСообщенияИзJSONВСписокНаОтправку(Знач стрJSON, Producer) Экспорт
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("Успешно", Ложь);
	сткРезультат.Вставить("стрОписаниеОшибки", "");
	
	сткРезультат.Успешно = Producer.SetJSONMessageList(стрJSON);
	Если сткРезультат.Успешно <> Истина Тогда 
		сткРезультат.стрОписаниеОшибки = Producer.ErrorDescription;
	КонецЕсли;

	Возврат сткРезультат;	
КонецФункции 

Функция ОтправитьСообщение(Producer) Экспорт

	//НачалоЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	сткРезультат = Отправитель_ДекодироватьКлючСообщенияКакBase64Строку(Producer);
	Если Не сткРезультат.Успешно Тогда Сообщить(сткРезультат.стрОписаниеОшибки);	Возврат Ложь; КонецЕсли;
	сткРезультат = Отправитель_ДекодироватьТелоСообщенияКакBase64Строку(Producer);
	Если Не сткРезультат.Успешно Тогда Сообщить(сткРезультат.стрОписаниеОшибки);	Возврат Ложь; КонецЕсли;
	сткРезультат = Отправитель_ДекодироватьЗначенияЗаголовковКакBase64Строку(Producer);
	Если Не сткРезультат.Успешно Тогда Сообщить(сткРезультат.стрОписаниеОшибки);	Возврат Ложь; КонецЕсли;
			
	сткРезультат = Отправитель_Отправить(Producer);
	Если Не сткРезультат.Успешно Тогда
		стрОписаниеОшибки = сткРезультат.стрОписаниеОшибки;
		// обработка ошибки
		Возврат Ложь;
	КонецЕсли;

	сткРезультат = Отправитель_ВсеСообщенияДоставлены(Producer);
	Если Не сткРезультат.Успешно Тогда
		стрОписаниеОшибки = сткРезультат.стрОписаниеОшибки;
		// обработка ошибки
		Возврат Ложь;
	КонецЕсли;
	
	//сткРезультат = Отправитель_ПолучитьJSONОтчетОДоставке();
	//Если Не сткРезультат.Успешно Тогда
	//	стрОписаниеОшибки = сткРезультат.стрОписаниеОшибки;
	//	// обработка ошибки
	//	Возврат Ложь;
	//КонецЕсли;
	
	//КонецЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
	//Длительность = КонецЗамера - НачалоЗамера;
	//Сообщить(СтрШаблон("Время отправки в миллисекундах: %1", Длительность));
	
	Возврат Истина;
	
КонецФункции

Функция Отправитель_ДекодироватьКлючСообщенияКакBase64Строку(Producer, булДекодировать = Ложь) 
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("Успешно", Ложь);
	сткРезультат.Вставить("стрОписаниеОшибки", "");		
	
	Producer.DecodeBase64Key = булДекодировать;
	сткРезультат.Успешно = Истина;
	Возврат сткРезультат;	
КонецФУнкции

Функция Отправитель_ДекодироватьТелоСообщенияКакBase64Строку(Producer, булДекодировать = Ложь) 
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("Успешно", Ложь);
	сткРезультат.Вставить("стрОписаниеОшибки", "");		
	
	Producer.DecodeBase64Value = булДекодировать;
	сткРезультат.Успешно = Истина;
	Возврат сткРезультат;	
КонецФУнкции

Функция Отправитель_ДекодироватьЗначенияЗаголовковКакBase64Строку(Producer, булДекодировать = Ложь) 
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("Успешно", Ложь);
	сткРезультат.Вставить("стрОписаниеОшибки", "");		
	
	Producer.DecodeBase64HeadersValue = булДекодировать;
	сткРезультат.Успешно = Истина;
	Возврат сткРезультат;	
КонецФУнкции

Функция Отправитель_Отправить(Producer) 
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("Успешно", Ложь);
	сткРезультат.Вставить("стрОписаниеОшибки", "");
	
	сткРезультат.Успешно = Producer.Produce();	
	Если сткРезультат.Успешно <> Истина Тогда
		сткРезультат.стрОписаниеОшибки = Producer.ErrorDescription;
		Возврат сткРезультат;	
	КонецЕсли;

	сткРезультат.Успешно = Истина;
	Возврат сткРезультат;	
КонецФункции

Функция Отправитель_ВсеСообщенияДоставлены(Producer) 
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("Успешно", Истина);
	сткРезультат.Вставить("булВсеСообщенияДоставлены", Ложь);

	сткРезультат.Вставить("стрОписаниеОшибки", "");	
	
	сткРезультат.булВсеСообщенияДоставлены = Producer.IsDelivered();
	Возврат сткРезультат;	
КонецФункции

Функция Отправитель_ПолучитьJSONОтчетОДоставке(Producer) 
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("Успешно", Ложь);
	сткРезультат.Вставить("стрОтчетОДоставке", Неопределено);
	сткРезультат.Вставить("стрОписаниеОшибки", "");
	
	сткРезультат.стрОтчетОДоставке = Producer.GetJSONDeliveryReport();	
	Если сткРезультат.стрОтчетОДоставке = Неопределено Тогда
		сткРезультат.стрОписаниеОшибки = Producer.ErrorDescription;
		Возврат сткРезультат;	
	КонецЕсли;

	сткРезультат.Успешно = Истина;
	Возврат сткРезультат;	
КонецФункции

#КонецОбласти

#Область Получение

Функция СоздатьПолучателя() Экспорт 

	сткРезультат = Новый Структура();
	сткРезультат.Вставить("Успешно", Ложь);
	сткРезультат.Вставить("стрОписаниеОшибки", "");
	сткРезультат.Вставить("Consumer", Неопределено);
	
	Попытка
		 сткРезультат.Consumer = Новый("AddIn.librdkafka.KafkaConsumer");
		 сткРезультат.Успешно = Истина;
		 Возврат сткРезультат;
	Исключение
	КонецПопытки;
	
	сткРезультатПодключения = ВыполнитьПодключениеВнешнейКомпоненты();
	Если Не сткРезультатПодключения.Успешно Тогда
		сткРезультат.стрОписаниеОшибки = сткРезультатПодключения.стрОписаниеОшибки;
		Возврат сткРезультат;	 
	КонецЕсли;
	 	 
	Попытка
		 сткРезультат.Consumer = Новый("AddIn.librdkafka.KafkaConsumer");
	Исключение
		сткРезультат.стрОписаниеОшибки = ОписаниеОшибки();
		Возврат сткРезультат;
	КонецПопытки;
	
	сткРезультат.Успешно = Истина;
	Возврат сткРезультат;
	
КонецФункции

Процедура Получатель_УстановитьПараметрыПоУмолчанию(Consumer) Экспорт 
	
	otus_kafka.Получатель_УстановитьПараметрГлобальный(Consumer, "message.max.bytes", "10000");
	otus_kafka.Получатель_УстановитьПараметрГлобальный(Consumer, "socket.timeout.ms", "40000");
	otus_kafka.Получатель_УстановитьПараметрГлобальный(Consumer, "enable.auto.commit", "false");
	otus_kafka.Получатель_УстановитьПараметрГлобальный(Consumer, "auto.commit.interval.ms", "0");  
	
	otus_kafka.Получатель_УстановитьПараметрТопика(Consumer, "compression.codec", "lz4");
	otus_kafka.Получатель_УстановитьПараметрТопика(Consumer, "auto.offset.reset", "smallest");
	
КонецПроцедуры

Функция Получатель_УстановитьПараметрГлобальный(Consumer, Знач стрКлюч, Знач стрЗначение) Экспорт
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("булУспешно", Ложь);
	сткРезультат.Вставить("стрОписаниеОшибки", "");	
		
	сткРезультат.булУспешно = Consumer.SetGlobalConf(стрКлюч, стрЗначение);
	Если сткРезультат.булУспешно <> Истина Тогда 
		сткРезультат.стрОписаниеОшибки = Consumer.ErrorDescription;
	КонецЕсли;
	
	Возврат сткРезультат;	
КонецФункции                                              

Функция Получатель_УстановитьПараметрТопика(Consumer, Знач стрКлюч, Знач стрЗначение) Экспорт
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("булУспешно", Ложь);
	сткРезультат.Вставить("стрОписаниеОшибки", "");	
		
	сткРезультат.булУспешно = Consumer.SetTopicConf(стрКлюч, стрЗначение);
	Если сткРезультат.булУспешно <> Истина Тогда 
		сткРезультат.стрОписаниеОшибки = Consumer.ErrorDescription;
	КонецЕсли;
	
	Возврат сткРезультат;	
КонецФункции

Функция Получатель_Подписаться(Знач мТопики, Consumer) Экспорт
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("Успешно", Ложь);
	сткРезультат.Вставить("стрОписаниеОшибки", "");	
	
	Результат = Consumer.ClearSubscribeList();
	Если Результат <> Истина Тогда
		сткРезультат.стрОписаниеОшибки = "Ошибка очистки списка топиков: " + Consumer.ErrorDescription;	
		Возврат сткРезультат;
	КонецЕсли;
	
	Для Каждого стрТопик Из мТопики Цикл 
		Результат = Consumer.AddTopicToSubscribeList(стрТопик);
		Если Результат <> Истина Тогда
			сткРезультат.стрОписаниеОшибки = "Ошибка добавления топика в список: " + Consumer.ErrorDescription;	
			Возврат сткРезультат;
		КонецЕсли;	
	КонецЦикла;
	
	Результат = Consumer.Subscribe();
	Если Результат <> Истина Тогда
		сткРезультат.стрОписаниеОшибки = "Ошибка подписания на топики: " + Consumer.ErrorDescription;	
		Возврат сткРезультат;
	КонецЕсли;
	
	сткРезультат.Успешно = Истина;	
	Возврат сткРезультат;	
КонецФункции

Функция ПрочитатьСообщение(Consumer) Экспорт

	ЧитатьСообщения = Истина;
	ЕстьОшибки = Ложь;
	
	тзДанные = Получатель_ПолучитьТаблицуСообщения();

	Пока ЧитатьСообщения Цикл
		чслЧтение = 1000;
		чслТаймаут = 1000;
		ЧитатьДД = Ложь;
		
		сткРезультат = Получатель_ЭкранироватьЗначениеСообщения(Consumer);
		Если Не сткРезультат.булУспешно Тогда
			стрОписаниеОшибки = сткРезультат.стрОписаниеОшибки;
			// обработка ошибки
			ЕстьОшибки = Истина;
			Прервать;
		КонецЕсли;	
		
		сткРезультат = Получатель_ЭкранироватьКлючСообщения(Consumer);
		Если Не сткРезультат.булУспешно Тогда
			стрОписаниеОшибки = сткРезультат.стрОписаниеОшибки;
			// обработка ошибки
			ЕстьОшибки = Истина;
			Прервать;
		КонецЕсли;	
		
		сткРезультат = Получатель_ЭкранироватьКлючиЗаголовков(Consumer);
		Если Не сткРезультат.булУспешно Тогда
			стрОписаниеОшибки = сткРезультат.стрОписаниеОшибки;
			// обработка ошибки
			ЕстьОшибки = Истина;
			Прервать;
		КонецЕсли;	
		
		сткРезультат = Получатель_ЭкранироватьЗначенияЗаголовков(Consumer);
		Если Не сткРезультат.булУспешно Тогда
			стрОписаниеОшибки = сткРезультат.стрОписаниеОшибки;
			// обработка ошибки
			ЕстьОшибки = Истина;
			Прервать;
		КонецЕсли;	

		
		//чНачало = ТекущаяУниверсальнаяДатаВМиллисекундах();
		сткРезультат = Получатель_ПрочитатьСписокСообщенийВПул(Consumer, чслЧтение, чслТаймаут, 10);
		Если Не сткРезультат.булУспешно Тогда
			стрОписаниеОшибки = сткРезультат.стрОписаниеОшибки;
			// обработка ошибки
			ЕстьОшибки = Истина;
			Прервать;
		КонецЕсли;	
		
		сткРезультат = Получатель_ПолучитьСообщенияИзПулаJSON(ЧитатьДД, Consumer);
		Если Не сткРезультат.булУспешно Тогда
			стрОписаниеОшибки = сткРезультат.стрОписаниеОшибки;
			// обработка ошибки
			ЕстьОшибки = Истина;
			Прервать;
		КонецЕсли;	
			
		//чОкончание = ТекущаяУниверсальнаяДатаВМиллисекундах();
		//Сообщить("Затрачено на получение: " + Строка(чОкончание - чНачало));

		сткРезультат = otus_ОбщегоНазначения.JSONВСтруктуру(сткРезультат.стрСообщения);
		Если Не сткРезультат.булУспешно Тогда
			стрОписаниеОшибки = сткРезультат.стрОписаниеОшибки;
			// обработка ошибки
			ЕстьОшибки = Истина;
			Прервать;
		КонецЕсли;	
		
		Если сткРезультат.масДанные.Количество() > 0 Тогда		
			сткРезультатФиксации = Получатель_ЗафиксироватьСмещения(Consumer);
			Если Не сткРезультатФиксации.булУспешно Тогда
				стрОписаниеОшибки = сткРезультат.стрОписаниеОшибки;
				// обработка ошибки
				ЕстьОшибки = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
		Если сткРезультат.масДанные.Количество() < 1000 Тогда 
			// больше нечего читать
			ЧитатьСообщения = Ложь;
		КонецЕсли;
				
		Для Каждого Элемент Из сткРезультат.масДанные Цикл
			
			стрДобавить = тзДанные.Добавить();
			ЗаполнитьЗначенияСвойств(стрДобавить, Элемент);	
			стрДобавить.headers = Получатель_ПолучитьТаблицуЗаголовки();
			
			Для Каждого СтрокаЗаголовок Из Элемент.Headers Цикл
				ЗаполнитьЗначенияСвойств(стрДобавить.headers.Добавить(), СтрокаЗаголовок);
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		Возврат Новый Структура("Успешно,Данные", Ложь, Неопределено);
	Иначе 
		Возврат Новый Структура("Успешно,Данные", Истина, тзДанные);
	КонецЕсли;
	
	
КонецФункции

Функция Получатель_ЭкранироватьКлючСообщения(Consumer, булЭкранировать = Истина) 
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("булУспешно", Ложь);
	сткРезультат.Вставить("стрОписаниеОшибки", "");		
	
	Consumer.EscapeMessageKey = булЭкранировать;
	сткРезультат.булУспешно = Истина;
	Возврат сткРезультат;	
КонецФУнкции

Функция Получатель_ЭкранироватьЗначениеСообщения(Consumer, булЭкранировать = Истина) 
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("булУспешно", Ложь);
	сткРезультат.Вставить("стрОписаниеОшибки", "");		
	
	Consumer.EscapeMessageValue = булЭкранировать;
	сткРезультат.булУспешно = Истина;
	Возврат сткРезультат;	
КонецФУнкции

Функция Получатель_ЭкранироватьКлючиЗаголовков(Consumer, булЭкранировать = Истина) 
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("булУспешно", Ложь);
	сткРезультат.Вставить("стрОписаниеОшибки", "");		
	
	Consumer.EscapeMessageHeaderKey = булЭкранировать;
	сткРезультат.булУспешно = Истина;
	Возврат сткРезультат;	
КонецФУнкции

Функция Получатель_ЭкранироватьЗначенияЗаголовков(Consumer, булЭкранировать = Истина) 
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("булУспешно", Ложь);
	сткРезультат.Вставить("стрОписаниеОшибки", "");		
	
	Consumer.EscapeMessageHeaderValue = булЭкранировать;
	сткРезультат.булУспешно = Истина;
	Возврат сткРезультат;	
КонецФУнкции



Функция Получатель_ПрочитатьСписокСообщенийВПул(Consumer, Знач чслКоличество, Знач чслТайимаутНаОдно, Знач ErrorCountToInterrupt = 1) 
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("булУспешно", Ложь);
	сткРезультат.Вставить("булТаймаут", Ложь);
	сткРезультат.Вставить("FatalError", Ложь);

	сткРезультат.Вставить("чКоличествоПрочитано", 0);	
	сткРезультат.Вставить("стрОписаниеОшибки", "");
	
	Результат = Consumer.ConsumePool(чслТайимаутНаОдно, чслКоличество, ErrorCountToInterrupt);
	Если Результат <> 1 Тогда
		сткРезультат.стрОписаниеОшибки = Consumer.ErrorDescription;
	КонецЕсли;
	
	сткРезультат.булТаймаут = (сткРезультат.стрОписаниеОшибки = "Local: Timed out") ИЛИ (сткРезультат.стрОписаниеОшибки = "Timeout: Local: Timed out")
		ИЛИ (сткРезультат.стрОписаниеОшибки = "Local queue is full");
	сткРезультат.булУспешно = (сткРезультат.булТаймаут ИЛИ Результат = 1) И НЕ Consumer.FatalError;
	сткРезультат.FatalError = Consumer.FatalError;
	
	сткРезультат.чКоличествоПрочитано = Consumer.GetMessagePoolLength();		
	Возврат сткРезультат;	
КонецФункции

Функция Получатель_ПолучитьСообщенияИзПулаJSON(Знач булПолучатьBase64, Consumer) 
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("булУспешно", Ложь);
	сткРезультат.Вставить("стрСообщения", Неопределено);
	сткРезультат.Вставить("стрОписаниеОшибки", "");	
		
	//Читаем из пула компоненты	
	сткРезультат.стрСообщения = Consumer.ReceiveJSONMessages(булПолучатьBase64);
	Если  сткРезультат.стрСообщения = Неопределено Тогда
		сткРезультат.стрОписаниеОшибки = Consumer.ErrorDescription;
		Возврат сткРезультат;
	КонецЕсли;	

	//Очищаем пул компоненты	
	Результат = Consumer.ClearMessagePool();
	Если Результат <> Истина Тогда
		сткРезультат.стрОписаниеОшибки = Consumer.ErrorDescription;
		Возврат сткРезультат;
	КонецЕсли;
	
	сткРезультат.булУспешно = Истина;
	Возврат сткРезультат;	
КонецФУнкции

Функция Получатель_ЗафиксироватьСмещения(Consumer) 
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("булУспешно", Ложь);
	сткРезультат.Вставить("стрОписаниеОшибки", "");	
		
	сткРезультат.булУспешно = Consumer.Commit();
	Если сткРезультат.булУспешно <> Истина Тогда 
		сткРезультат.стрОписаниеОшибки = Consumer.ErrorDescription;
	КонецЕсли;
	
	Возврат сткРезультат;	
КонецФУнкции

Функция Получатель_ПолучитьТаблицуСообщения() 
	
	тзРезультат = Новый ТаблицаЗначений();
	
	тзРезультат.Колонки.Добавить("key", 		);
	тзРезультат.Колонки.Добавить("value", 		);
	тзРезультат.Колонки.Добавить("topic", 		Новый ОписаниеТипов("Строка"));
	тзРезультат.Колонки.Добавить("partition", 	Новый ОписаниеТипов("Число"));
	тзРезультат.Колонки.Добавить("offset", 		Новый ОписаниеТипов("Число"));
	тзРезультат.Колонки.Добавить("timestamp", 	Новый ОписаниеТипов("Число"));
	тзРезультат.Колонки.Добавить("headers", 	Новый ОписаниеТипов("ТаблицаЗначений"));
	
	Возврат тзРезультат;	
КонецФункции

Функция Получатель_ПолучитьТаблицуЗаголовки() 
	
	тзРезультат = Новый ТаблицаЗначений();
	
	тзРезультат.Колонки.Добавить("key", 	);
	тзРезультат.Колонки.Добавить("value",	);
		
	Возврат тзРезультат;	
КонецФункции


#КонецОбласти





