
#Область СлужебныйПрограммныйИнтерфейс

Функция СоздатьСоединение(Направление, ИмяГруппы = "") Экспорт

	// Конструктор объекта 'Справочник.otus_Соединения'
	ТестовыйДокумент = Ютест.Данные().КонструкторОбъекта("Справочник.otus_Соединения")
		.ФикцияОбязательныхПолей()	
		.Установить("Наименование", "Тестовое соединение")
		.Установить("Активно", Истина)
		.Установить("Адрес", "kafka:9092")
		.ТабличнаяЧасть("Состав").ДобавитьСтроку()
			.Установить("Активно", Истина)
			.Установить("ТипОбъекта", "Документ._ДемоЗаказПокупателя")
			.Установить("УсловиеВыгрузки", "Результат = (Объект.СтатусЗаказа = Перечисления._ДемоСтатусыЗаказовПокупателей.Создан)")
			.Установить("ИмяОчереди", "testTopic")
			.Установить("НаправлениеОбмена", Направление)
			.Установить("Группа", ИмяГруппы)
	.Записать()
	;
	
	Возврат ТестовыйДокумент;
	
КонецФункции

Функция СоздатьДокументЗаказКлиента(ОсновныеДанные, Статус) Экспорт

	// Конструктор объекта 'Документ._ДемоЗаказПокупателя'
	ТестовыйДокумент = Ютест.Данные().КонструкторОбъекта("Документ._ДемоЗаказПокупателя")
		.ФикцияОбязательныхПолей()		
		.Установить("Дата", ТекущаяДатаСеанса())
		.Установить("СуммаДокумента", 1000)
		.Установить("Партнер", ОсновныеДанные.Партнер)
		.Установить("Организация", ОсновныеДанные.Организация)
        .Установить("СтатусЗаказа", Статус)
	.Записать()
	;
	
	Возврат ТестовыйДокумент;
	
КонецФункции


#КонецОбласти